app/controllers/leaves_controller.rb

   def create
     @leave = Leave.new(leave_params)
      if @leave.save
---
INSERT INTO `leaves` (`start_date`, `end_date`, `reason`, `leave_type`, `created_at`, `updated_at`, `requestor`, `status`, `approver`, `approve_status`) VALUES ('2023-10-20', '2023-10-21', '我的测试100', '丧假', '2023-10-17 15:18:24.951892', '2023-10-17 15:18:24.951892', '业务经理', NULL, NULL, '待审批')

   def fetch
     @leaves = Leave.where(requestor: current_user.username)
---
SELECT `leaves`.* FROM `leaves` WHERE `leaves`.`requestor` = '李四'

   def fetch_toapprove
     @leaves = Leave.where(approve_status: "待审批")
---
SELECT `leaves`.* FROM `leaves` WHERE `leaves`.`approve_status` = '待审批'

 def toapprove
  leave = Leave.find(params[:id])
  leave.update(approve_status: "已批准")
---
SELECT `leaves`.* FROM `leaves` WHERE `leaves`.`id` = 4 LIMIT 1
UPDATE `leaves` SET `leaves`.`updated_at` = '2023-10-17 13:14:19.295626', `leaves`.`approve_status` = '已批准' WHERE `leaves`.`id` = 4

 def toreject
  leave = Leave.find(params[:id])
  leave.update(approve_status: "已拒绝")
---
SELECT `leaves`.* FROM `leaves` WHERE `leaves`.`id` = 18 LIMIT 1
UPDATE `leaves` SET `leaves`.`updated_at` = '2023-10-17 14:04:39.892184', `leaves`.`approve_status` = '已拒绝' WHERE `leaves`.`id` = 18